Extensions/src/Documents/НачислениеНалогов/НачислениеНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НачислениеНалогов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>AzRyПроект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Налоги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидНалога</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СрокУплаты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидНалогаКор</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Корреспонденция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КорреспонденцияРегл</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыСчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтруктурныеЕдиницы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценкиРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаВРозницеРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТранзитныйСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2476bac7-ac47-4539-b1e8-e2d3bf18251a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9c066e5e-772c-41f3-a166-f05418941f43">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fbc2f281-6c3d-40a3-8694-f63ee1b7c004">
    <name>МобильныйСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e7c8071-6699-4ffa-8e31-632371d38966">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a3c31f5-df02-4d10-85cf-8de9a532e621">
    <name>КонтролироватьОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0e75e44-b673-4934-ab3e-706832cd4d5b">
    <name>МОЛ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f1698386-44f2-4be3-b7c2-f01948b980b9">
    <name>ПодписьМОЛ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5b82dccb-cc9f-41eb-8088-42b881c700e8">
    <name>СкладПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="656ab4e2-875b-48fe-96a0-a50b1f498e73">
    <name>AzRyТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a579788-8f60-4358-a54a-2a1b02be6ac8">
    <name>ИсточникПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7782722e-bdd4-4fb4-9aad-904d3cbaa532">
    <name>ЯчейкаИсточникаПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b77a40db-fbeb-4e1a-ad6a-9bf23c457c17">
    <name>ПолучательПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eca6f5be-c6dc-4160-a697-6b7a5fb2e2f6">
    <name>ЯчейкаПолучателяПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2edf53a7-41c8-460f-ad0f-84e600aa72b1">
    <name>ПолучательОтходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c794327-8af4-4a49-b6a0-d259525111e4">
    <name>ЯчейкаПолучателяОтходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b70e2659-f15b-4900-b5fc-2fdb61a9a842">
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c924b59-ea01-4bad-8232-d49b30e697f3">
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd1a0c83-6366-4c74-bf87-8c83627193d6">
    <name>ИсточникСписанияНаРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e354ed7f-41df-4b9f-bcba-6872f26b1bfe">
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ab9b51b3-1550-4b5b-9a10-bf4887a99d55">
    <name>ПолучательСписанияНаРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8af298a-c0e6-49a0-8eee-dbfc82f587a0">
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb5e878a-467a-4761-8d21-d6bbdc308800">
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa0ea93c-0c7c-4188-a10b-9ee853b4ff8d">
    <name>ИсточникПередачиВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64e09721-89ea-4912-9775-8bfd08436cf9">
    <name>ПолучательПередачиВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0504da55-3039-41b1-865a-3598742f0f25">
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="318e954d-2e1d-430f-a6f6-449070386053">
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbec7716-7783-4401-b00a-8e05349f24bb">
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="62c9addc-f9c5-4262-8192-a7d73e71f636">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fd4a9e59-595c-4e13-b2e8-facee41c4a11">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="91b69288-1b46-4cf5-be5e-e625af9b4811">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3782156e-6bb1-4dbb-98cf-52c91b1c3e87">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e8707eb3-6c5f-44ef-84aa-07b0376ab196">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="032a7655-91a9-4429-a9c1-e5ad236e5995">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="593279ce-6c0c-4900-9429-d5cb335b4d23">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0968bf2f-4915-4a51-baeb-24e37a11f128">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b481105-7d08-4435-9d4a-d7bef6b0a14f">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="77c1af75-d10c-432f-98e7-8cc28c888107">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b7f5f9eb-a0cb-4e47-b909-8b47ffbb7351">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="87bbd8a2-31f4-49cf-aec5-f8765f4f3857">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="403e370d-5c7d-4010-93e7-ea8729e934a9">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="64ffead8-4404-4f60-8592-b4020b98da25">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6eaeb4e5-7d2d-492d-98cb-c3be6dba9e72">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="95c6d95d-598e-44ad-a826-97f6b608bbe2">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Extensions/src/Documents/НачислениеНалогов/ManagerModule.bsl
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеНалогов, СтруктураДополнительныеСвойства)
	
	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	МассивСчетовФинРезДоходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезДоход();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
	|	ТаблицаДокумента.ВидНалога.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.ВидНалога.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|	ТаблицаДокумента.Сумма,
	|	ТаблицаДокумента.СрокУплаты,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|			ТОГДА &НачисленНалог
	|		ИНАЧЕ &ВозмещенНалог
	|	КОНЕЦ КАК СодержаниеПроводки
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.ВидНалогаКор,
	|	ТаблицаДокумента.ВидНалогаКор.СчетУчета,
	|	ТаблицаДокумента.ВидНалогаКор.СчетУчетаРегл,
	|	ТаблицаДокумента.Сумма,
	|	ТаблицаДокумента.СрокУплаты,
	|	&Взаиморасчет
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	//+++ Дмгг
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	//|		ИНАЧЕ ТаблицаДокумента.НаправлениеДеятельности
	//|	КОНЕЦ КАК НаправлениеДеятельности,
	//|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	//|		ИНАЧЕ ТаблицаДокумента.Подразделение
	//|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|				И (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				И (ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ ТаблицаДокумента.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|				И (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				И (ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Подразделение
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	//--- Дмгг
	|	ТаблицаДокумента.Корреспонденция КАК СчетУчета,
	|	ТаблицаДокумента.КорреспонденцияРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.ВидНалога КАК Аналитика,
	//+++ Дмгг
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	//|			ТОГДА НЕОПРЕДЕЛЕНО
	//|		ИНАЧЕ ТаблицаДокумента.ЗаказПокупателя
	//|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов 
	|				И (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов 
	|				И (ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.ЗаказПокупателя
	|	КОНЕЦ КАК ЗаказПокупателя,
	//--- Дмгг
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|			ТОГДА &Расходы
	|		ИНАЧЕ &Доходы
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ТаблицаДокумента.Сумма КАК Сумма
	// +++ { AzRy - [20.12.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment: დაემატა თეოს თხოვნით
	|   ,ТаблицаДокумента.Ссылка.AzRyПроект КАК Проект 					
	// +++ } AzRy - [20.12.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment: დაემატა თეოს თხოვნით	
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка   
	//+++ Дмгг
	//|	И (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	//|			ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|			ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	//|			ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	//|			ИЛИ ТаблицаДокумента.КорреспонденцияРегл В (&СчетаФинРезРасходы, &СчетаФинРезДоходы))
	|	И ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|					ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|					ИЛИ ТаблицаДокумента.КорреспонденцияРегл В (&СчетаФинРезРасходы, &СчетаФинРезДоходы))
	|		ИНАЧЕ (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|					ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|					ИЛИ ТаблицаДокумента.КорреспонденцияРегл В (&СчетаФинРезРасходы, &СчетаФинРезДоходы))
	|	КОНЕЦ
	//--- Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА ТаблицаДокумента.Корреспонденция
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|			ТОГДА ТаблицаДокумента.ВидНалогаКор.СчетУчетаКВозмещению
	|		ИНАЧЕ ТаблицаДокумента.ВидНалога.СчетУчетаКВозмещению
	|	КОНЕЦ КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	0 КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|			ТОГДА ТаблицаДокумента.ВидНалога.СчетУчета
	|		ИНАЧЕ ТаблицаДокумента.Корреспонденция
	|	КОНЕЦ КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	0 КАК СуммаВалКт,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА &НачисленНалог
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Взаиморасчет)
	|			ТОГДА &Взаиморасчет
	|		ИНАЧЕ &ВозмещенНалог
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Подразделение КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Корреспонденция КАК СчетУчета,
	|	ТаблицаДокумента.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&НачисленНалог КАК СодержаниеПроводки,
	|	ТаблицаДокумента.КорреспонденцияРегл КАК СчетУчетаРегл
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	//+++ Дмгг
	//|	И (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	//|			ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))");
	|	И ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА (ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|					ИЛИ ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
	|		ИНАЧЕ (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|					ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
	|	КОНЕЦ");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеНалогов);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачисленНалог", НСтр("ka='დარიცხულია გადასახადი';ru='Начислен налог';en='accrued tax'"));
	Запрос.УстановитьПараметр("ВозмещенНалог", НСтр("ka='გადასახადი ანაზღაურებულია';ru='Возмещен налог';en='tax refunded'"));
	Запрос.УстановитьПараметр("Доходы", НСтр("ka='შემოსავლები';ru='Доходы';en='earnings'")); 
	Запрос.УстановитьПараметр("Расходы", НСтр("ka='დანახარჯები';ru='Расходы';en='Costs'")); 
	Запрос.УстановитьПараметр("Взаиморасчет", НСтр("ka='დანახარჯები';ru='Расходы';en='Costs'"));
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	Запрос.УстановитьПараметр("СчетаФинРезДоходы", МассивСчетовФинРезДоходы);
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", МассивРезультатов[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", МассивРезультатов[2].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", МассивРезультатов[3].Выгрузить());
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_НачислениеНалогов(ДокументСсылкаНачислениеНалогов, СтруктураДополнительныеСвойства);
	// Щербаков ---

КонецПроцедуры
